In [1]:
import pymysql

In [2]:
mydb = pymysql.connect(host='localhost', user='root', password='0exia099', db='StudentDB')

In [4]:
mc = mydb.cursor()

In [5]:
mc.execute("select * from student where deptno = 30")
result = mc.fetchall()  #튜플로 받아짐, 다 받기
for x in result:
    print(x)

(1002, 'Emily', 30, 302, 'F', 'Seoul', datetime.date(1992, 4, 29), Decimal('3.25'))
(1008, 'Gildong', 30, 302, 'M', 'Pohang', datetime.date(1995, 8, 16), Decimal('3.31'))
(1013, 'Brown', 30, 302, 'M', 'Daegu', datetime.date(1988, 2, 21), Decimal('1.75'))

In [6]:
mc.execute("select sid, sname, grade from student where deptno = 30")
result = mc.fetchone()  #하나만 받기
print(result)

(1002, 'Emily', Decimal('3.25'))

In [7]:
result = mc.fetchone()   #다음거 받아짐
print(result)

(1008, 'Gildong', Decimal('3.31'))

In [9]:
mc.execute("select * from student")
result = mc.fetchmany(3)  #n개 받기
print(result)

((1001, 'Minsu', 10, 101, 'M', 'Daegu', datetime.date(1995, 12, 15), Decimal('3.93')), (1002, 'Emily', 30, 302, 'F', 'Seoul', datetime.date(1992, 4, 29), Decimal('3.25')), (1003, 'Suji', 10, 102, 'F', 'Daegu', datetime.date(1988, 1, 3), Decimal('4.17')))

In [12]:
sql = "select * from student where grade >= %s"  #%s에 인자설정
grade = (4.0,)
mc.execute(sql,grade)
result = mc.fetchall()
for x in result:
    print(x)

(1003, 'Suji', 10, 102, 'F', 'Daegu', datetime.date(1988, 1, 3), Decimal('4.17'))
(1010, 'Taehee', 20, 202, 'F', 'Busan', datetime.date(1996, 7, 3), Decimal('4.41'))

In [18]:
deptno, grade = input("deptno와 학점을 입력: ").split()
deptno, grade = int(deptno), float(grade)

deptno와 학점을 입력: 10 3.0

In [21]:
sql = "select * from student where deptno = %s and grade >= %s"
val = (deptno, grade)
mc.execute(sql,val)
result = mc.fetchall()
res = [(item[0], item[1], str(item[2]), float(item[3])) for item in result]
for x in res:
    print(x)

(1001, 'Minsu', '10', 101.0)
(1003, 'Suji', '10', 102.0)
(1012, 'Sarang', '10', 101.0)

In [22]:
sql = "insert into department values (60, 'Statistics', 'Sciences', 30000000)"
mc.execute(sql)
mydb.commit() #commit안하면 임시로만 저장되고 db에 저장 안됨
print(mc.rowcount,"record inserted.")

1 record inserted.

In [24]:
mc.execute("select * from department")
result = mc.fetchall()
for x in result:
    print(x)

(10, 'Computer', 'Engineering', 10000000)
(20, 'Mechanical', 'Engineering', 20000000)
(30, 'Physics', 'Sciences', 10000000)
(40, 'Korean Language', 'Liberal Arts', 8000000)
(50, 'General Education', 'Basic Studies', 8000000)
(60, 'Statistics', 'Sciences', 30000000)

In [25]:
sql = "insert into department(deptno, dname) values (%s, %s)"  #%s로 추가
val = [(70,'Philosophy'),(80,'기계공학과'),(90,'전기공학과'),(100,'식품공학과')] #여러개 추가
mc.executemany(sql, val)
mydb.commit()
print(mc.rowcount, "record inserted.")

-1 record inserted.

In [26]:
mc.execute("select * from department")
result = mc.fetchall()
for x in result:
    print(x)

(10, 'Computer', 'Engineering', 10000000)
(20, 'Mechanical', 'Engineering', 20000000)
(30, 'Physics', 'Sciences', 10000000)
(40, 'Korean Language', 'Liberal Arts', 8000000)
(50, 'General Education', 'Basic Studies', 8000000)
(60, 'Statistics', 'Sciences', 30000000)
(70, 'Philosophy', None, None)
(80, '기계공학과', None, None)
(90, '전기공학과', None, None)
(100, '식품공학과', None, None)

In [27]:
sql = "delete from department where deptno > %s"  #삭제
val = (50,)
mc.execute(sql,val)
mydb.commit()
print(mc.rowcount, "record deleted.")

5 record deleted.

In [28]:
mc.execute("select * from department")
result = mc.fetchall()
for x in result:
    print(x)

(10, 'Computer', 'Engineering', 10000000)
(20, 'Mechanical', 'Engineering', 20000000)
(30, 'Physics', 'Sciences', 10000000)
(40, 'Korean Language', 'Liberal Arts', 8000000)
(50, 'General Education', 'Basic Studies', 8000000)

In [29]:
sql = "create table logs (id int auto_increment primary key, type int, place varchar(40) , time datetime)"
mc.execute(sql)
mydb.commit()

In [30]:
mc.execute("show tables")

4

In [32]:
for x in mc:
    print(x)

('DEPARTMENT',)
('logs',)
('PROFESSOR',)
('STUDENT',)

In [45]:
import datetime
sql = "insert into logs(id, type, place, time) values (%s, %s, %s, %s)"
val = (1, 8, "대구", datetime.datetime.now())
mc.execute(sql,val)
mydb.commit()
print(mc.rowcount,"record inserted.")

1 record inserted.

In [46]:
mc.execute("select * from logs")
result = mc.fetchall()
for x in result:
    print(x)

(1, 8, '대구', datetime.datetime(2022, 7, 22, 13, 54, 6))

In [50]:
import datetime
import random

places = ['대구','서울','부산','울산','광주','인천','대전']
types = list(range(1,11))
val=[]
sql = "insert into logs(type, place, time) values (%s, %s, %s)"
for _ in range(100):
    tp = random.choice(types)
    pl = random.choice(places)
    now = datetime.datetime.now()
    d = random.randint(-365,0)
    h = random.randint(-12,0)
    s = random.randint(1,3600)
    time = now + datetime.timedelta(days=d, hours = h, seconds = s)
    val.append((tp,pl,time))
    
mc.executemany(sql,val)
mydb.commit()

print(mc.rowcount, "record inserted.")

100 record inserted.

In [51]:
print("123")

123